; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph2 - mode
	image0 - mode
	thermograph1 - mode
	Star0 - direction
	Star2 - direction
	Star3 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	GroundStation1 - direction
	Star7 - direction
	GroundStation4 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(have_image Star10 thermograph1)
	(have_image Planet11 thermograph2)
	(have_image Phenomenon12 thermograph2)
	(have_image Phenomenon13 image0)
	(have_image Phenomenon14 image0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 5
3. (turn_to satellite0 phenomenon12 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon12)
   goals met: 0 of 5
4. (take_image satellite0 phenomenon12 instrument1 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 1 of 5
5. (turn_to satellite0 phenomenon13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 5
6. (take_image satellite0 phenomenon13 instrument1 image0)
   added: (have_image phenomenon13 image0)
   goals met: 2 of 5
7. (turn_to satellite0 phenomenon14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 5
8. (take_image satellite0 phenomenon14 instrument1 image0)
   added: (have_image phenomenon14 image0)
   goals met: 3 of 5
9. (turn_to satellite0 planet11 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet11)
   goals met: 3 of 5
10. (take_image satellite0 planet11 instrument1 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 4 of 5
11. (turn_to satellite0 star10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star10)
   goals met: 4 of 5
12. (take_image satellite0 star10 instrument1 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 5 of 5
